AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ВыгрузкаНаличия/Ext/Module.bsl
Функция ВыгрузитьВCSV(ИмяФайлаCSV);
	
	Разделитель = Символы.Таб;
	ТаблицаЗначений = ТаблицаНаличие();
	Текст = СоздатьДанныеCSV(ТаблицаЗначений, Разделитель);	 
	ЗаписатьCSV(Текст, ИмяФайлаCSV);
	
КонецФункции

Функция ТаблицаНаличие()
	
	ТабДок = Новый ТаблицаЗначений;
	ТабДок.Колонки.Добавить("Производитель");
	ТабДок.Колонки.Добавить("Артикул"); 
	ТабДок.Колонки.Добавить("НомерПроизводителя");
	ТабДок.Колонки.Добавить("Наименование"); 	
	ТабДок.Колонки.Добавить("ЕдИзмерения");
	ТабДок.Колонки.Добавить("МинимальнаяУп");
	ТабДок.Колонки.Добавить("Колво");
	ТабДок.Колонки.Добавить("Цена");
	
	СкладОсновной  = Константы.ОсновнойСклад.Получить();
	
	Запрос = Новый Запрос;   
	
	Запрос.Текст = "ВЫБРАТЬ
	
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка КАК НоменклатураСсылка
	|	ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|	ГДЕ
	|	ТоварыНаСкладахОстатки.Склад = &Склад"; 
	
	Запрос.УстановитьПараметр("Склад", СкладОсновной);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Сч = 0;
	
	Пока Выборка.Следующий() Цикл 
		
		КоличествоВОстатке 	= Число(Выборка.Количество);
		ОстатокВРезерве 	= ПолучитьОстатокВРезерве(Выборка.НоменклатураСсылка, СкладОсновной);	
		Цена 				= ПолучитьЦену(Выборка.НоменклатураСсылка);
		Кратность			= Выборка.Номенклатура.Кратность;
		
		Если Кратность = 0 Тогда
			Кратность = 1;
		КонецЕсли; 
		
		НоваяСтрока = ТабДок.Добавить();
		
		Если ОстатокВРезерве = 0 И Цена <> 0 Тогда
			
			Сч = Сч + 1; 
			
			НоваяСтрока.Производитель 		=   Выборка.Номенклатура.Родитель;
			НоваяСтрока.Артикул 			=   Выборка.Номенклатура.Артикул;                 
			НоваяСтрока.НомерПроизводителя 	=   "'" + Выборка.Номенклатура.КодПроизводителя;
			НоваяСтрока.Наименование 		=   Выборка.Номенклатура;
			НоваяСтрока.ЕдИзмерения 		=   ПолучитьЕденицы(Выборка.Номенклатура);
			НоваяСтрока.МинимальнаяУп 		=   Кратность;
			НоваяСтрока.Колво 				=	КоличествоВОстатке;
			НоваяСтрока.Цена 				=   Цена;
			
		Иначе
			
			Если КоличествоВОстатке - ОстатокВРезерве > 0 И Цена <> 0 Тогда
				
				Сч = Сч + 1;         
				
				НоваяСтрока.Производитель 		=   Выборка.Номенклатура.Родитель;
				НоваяСтрока.Артикул 			=   Выборка.Номенклатура.Артикул;                 
				НоваяСтрока.НомерПроизводителя 	=   "'" + Выборка.Номенклатура.КодПроизводителя;
				НоваяСтрока.Наименование 		=   Выборка.Номенклатура;
				НоваяСтрока.ЕдИзмерения 		=   ПолучитьЕденицы(Выборка.Номенклатура);
				НоваяСтрока.МинимальнаяУп 		=   Кратность;
				НоваяСтрока.Колво 				=	КоличествоВОстатке - ОстатокВРезерве;
				НоваяСтрока.Цена 				=   Цена;      
				
			Иначе
				
				Сч = Сч + 1;
				
				НоваяСтрока.Производитель 		=   Выборка.Номенклатура.Родитель;
				НоваяСтрока.Артикул 			=   Выборка.Номенклатура.Артикул;                 
				НоваяСтрока.НомерПроизводителя 	=   "'" + Выборка.Номенклатура.КодПроизводителя;
				НоваяСтрока.Наименование 		=   Выборка.Номенклатура;
				НоваяСтрока.ЕдИзмерения 		=   ПолучитьЕденицы(Выборка.Номенклатура);
				НоваяСтрока.МинимальнаяУп 		=   Кратность;
				НоваяСтрока.Колво 				=	0;
				НоваяСтрока.Цена 				=   Цена;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции	

Функция СоздатьДанныеCSV(ТаблицаЗначений, Разделитель)
	
	К = 0;
	Текст = "";
	
	Для каждого запись Из ТаблицаЗначений Цикл
		
		Если Текст = "" Тогда
			Текст = СоздатьЗаголовкиCSV(ТаблицаЗначений, Разделитель) + Символы.ПС;    
		КонецЕсли;    

		К = К + 1; 
		
		Если НЕ ПустаяСтрока(запись.Наименование) Тогда
			
			текст = текст  
			+ запись.Производитель
			+ разделитель + запись.Артикул
			+ разделитель + запись.НомерПроизводителя
			+ разделитель + запись.Наименование
			+ разделитель + запись.ЕдИзмерения
			+ разделитель + запись.МинимальнаяУп  
			+ разделитель + запись.Колво
			+ разделитель + запись.Цена
			+ Символы.ПС; 
			
		КонецЕсли; 
		
	КонецЦикла;

	Возврат Текст;
	
КонецФункции //

Функция СоздатьЗаголовкиCSV(ТаблицаЗначений, Разделитель)

	КолонкиТЗ = ТаблицаЗначений.колонки;
	
	Для каждого Колонка Из КолонкиТЗ Цикл
		стрКолонки = "" + стрКолонки + Колонка.Имя + Разделитель;
	КонецЦикла;
	
	Возврат стрКолонки; 
	
КонецФункции

Функция ЗаписатьCSV(Текст, ИмяФайла)   
	
	Кодировка = КодировкаТекста.ANSI;
	
	ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяФайла, Кодировка);            
	ТекстовыйФайлЗапись.ЗаписатьСтроку(Текст); 
	ТекстовыйФайлЗапись.Закрыть(); 
	
	Возврат 0;
	
КонецФункции // ЗаписатьCSV()

Функция ДатаПропись()
		
	Перем Результат; 
	
	Дат = ТекущаяДата();
	Результат = "";
	
	Если ТипЗнч(Дат) = Тип("Дата") Тогда
		
		Результат = Формат(Дат, "ДФ=""дд_ММ_гг' 'ЧЧ'-'мм""");
		Результат = ("portal_" + Результат); 
		
	КонецЕсли;  
	
	Возврат Результат 
	
КонецФункции

Функция ПолучитьЦену(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныНоменклатуры.Период КАК Период,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|	ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|  УПОРЯДОЧИТЬ ПО
	|  ЦеныНоменклатуры.Регистратор.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Выборка.Цена;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОстатокВРезерве(Номенклатура,Склад)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ ((ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток) КАК ЧИСЛО(15,2)) КАК  КоличествоРезерв
	|	ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	|	ГДЕ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура.Ссылка = &Номенклатура И
	|	ТоварыВРезервеНаСкладахОстатки.Склад = &Склад";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Выборка.КоличествоРезерв;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЕденицы(Номенклатура)
	
	Запрос = Новый Запрос;	
	Запрос.Текст = " ВЫБРАТЬ
	|	ЕдиницыИзмерения.Наименование как Наименование
	|	ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|	ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	Если Результат.Пустой() Тогда
		Возврат 1;
	Иначе
		Возврат Выборка.Наименование;
	КонецЕсли;
	
КонецФункции 

Процедура СозданиеБлокировки()
	
	FTPСоединение = Новый FTPСоединение("portal.moskvorechie.ru",, "ftp_price31", "VD8t7Do4EK",, Истина);
		
	ИмяФайлОтправки = "D:\1C\Nalich\load.lock";
	ИмяВыходногоФайла = "load.lock";
	
	FTPСоединение.Записать(ИмяФайлОтправки, ИмяВыходногоФайла); 
	
КонецПроцедуры

Процедура ЗагрузкаНаличия()
		
	FTPСоединение = Новый FTPСоединение("portal.moskvorechie.ru",, "ftp_price31", "VD8t7Do4EK",, Истина);
		
	ИмяФайлОтправки = "D:\1C\Nalich\price.file";
	ИмяВыходногоФайла = "price.file";
		
	FTPСоединение.Записать(ИмяФайлОтправки, ИмяВыходногоФайла); 
	
КонецПроцедуры

Процедура УдалениеБлокировки()
	
	FTPСоединение = Новый FTPСоединение("portal.moskvorechie.ru",, "ftp_price31", "VD8t7Do4EK",, Истина);
	
	ИмяВыходногоФайла = "load.lock";
		
	FTPСоединение.Удалить(ИмяВыходногоФайла); 
	
КонецПроцедуры

Процедура ВыгрузкаНаличия() Экспорт

	СозданиеБлокировки();
	ВыгрузитьВCSV("D:\1C\Nalich\price.file");
	ЗагрузкаНаличия();
	УдалениеБлокировки();
	
КонецПроцедуры
